---
kind: property
id: P:Autodesk.Revit.DB.Dimension.References
zh: 尺寸标注、标注
source: html/fc3bc889-b274-3262-a126-849df2af9019.htm
---
# Autodesk.Revit.DB.Dimension.References Property

**中文**: 尺寸标注、标注

Returns an array of geometric references to which the dimension is attached.

## Syntax (C#)
```csharp
public ReferenceArray References { get; }
```